onec-mid-base-11/src/Documents/НАШ_УстановкаСкидокКонтрагенты/НАШ_УстановкаСкидокКонтрагенты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>НАШ_УстановкаСкидокКонтрагенты</name>
  <registerRecords>InformationRegister.НАШ_СкидкиКонтрагенты</registerRecords>
  <attributes>
    <name>НАШ_Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>НАШ_Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>НАШ_Согласовано</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТабличнаяЧасть</name>
    <attributes>
      <name>НАШ_Контрагент</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>НАШ_Скидка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

onec-mid-base-11/src/InformationRegisters/НАШ_СкидкиКонтрагенты/НАШ_СкидкиКонтрагенты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НАШ_СкидкиКонтрагенты</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Скидка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

onec-mid-base-11/src/Documents/НАШ_УстановкаСкидокКонтрагенты/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОписаниеПеременных


#КонецОбласти

#Область ПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, Режим)
	
	Перем НАШ_Скидки;
	Если НАШ_Согласовано = Ложь Тогда 
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = "Документ не согласован.Проведение невозможно.Без согласования документ можно только записать";
		Сообщение.Сообщить();		
		Отказ = Истина;
	КонецЕсли;
	
	Движения.НАШ_СкидкиКонтрагенты.Записывать = Истина;
	Для Каждого ТекСтрокаНАШ_Скидки Из НАШ_Скидки Цикл
		Движение = Движения.НАШ_СкидкиКонтрагенты.Добавить();
		Движение.Период = Дата;
		Движение.Контрагент = ТекСтрокаНАШ_Скидки.НАШ_Контрагент;
		Движение.Скидка = ТекСтрокаНАШ_Скидки.НАШ_Скидка;
	КонецЦикла;
	
КонецПроцедуры


#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Код процедур и функций

#КонецОбласти

#Область Инициализация

#КонецОбласти

#КонецЕсли
